#include <stdio.h>   // printf() এর জন্য
#include <stdbool.h> // bool, true, false ব্যবহার করার জন্য

int main()
{
    // ================================
    // Boolean variable (true/false)
    // ================================
    bool b; // bool টাইপের ভেরিয়েবল (শুধু true বা false রাখে)

    b = true; // এখানে b এর মান true দেওয়া হয়েছে

    // ================================
    // Output
    // ================================
    // %d ব্যবহার করা হয়েছে কারণ bool internally 1 বা 0 হিসেবে থাকে
    printf("%d", b);

    // ================================
    // Program End
    // ================================
    return 0;
}